<template><div><div class="hint-container warning">
<p class="hint-container-title">Warning</p>
<p>Edit (2019-03-18): Due to image host service issue, some images in this post were lost.</p>
</div>
<p><a href="http://xs223.xs.to/xs223/08041/le1620352.gif" target="_blank" rel="noopener noreferrer"><img src="http://xs223.xs.to/xs223/08041/le1620352.gif" alt=""></a></p>
<p>這張圖是AMD Athlon64 LE 1620的CPU-Z資料圖</p>
<p>==</p>
<p>想換CPU了</p>
<p>可是不想換雙核心</p>
<p>現在的作業系統、程式、遊戲等等都還沒有辦法完全利用多核心</p>
<p>而多核心處理器如果沒有完全利用</p>
<p>其效能甚至會比單核心還要弱</p>
<p>==</p>
<p>這麼說吧</p>
<p>為什麼會有雙核心的出現？</p>
<p>記得當初處理器</p>
<p>從很早很早的MHz時代到現在的GHz時代</p>
<p>一直到現在處理器的時脈發展遇到了瓶頸</p>
<p>可以說是已經到了一種極限了</p>
<p>但生意還是要做</p>
<p>聰明的商人把舊的處理器把他裝在一起</p>
<p>告訴你說 我這是顆劃世代的多核心處理器喔</p>
<p>==</p>
<p>這麼來看吧</p>
<p>單核心處理器從一開始一路上揚發展到極致</p>
<p>到最後走投無路了開始回頭拿低時脈的處理器發展雙核心</p>
<p>接下來雙核心又達到了極致</p>
<p>很快的四核心、十六核心就來接手</p>
<p>如此才有賣點</p>
<p>==</p>
<p>我不是否定多核心的技術</p>
<p>我相信能把好幾顆處理器塞成一顆一定也要有點技術</p>
<p>而且多顆核心加起來跑一定也比較快</p>
<p>現在重點是在軟體 真的有多顆核心在跑嗎？</p>
<p>==</p>
<p>處理器已經多核心了</p>
<p>那我們的軟體呢？</p>
<p>當初軟體設計時</p>
<p>那時並沒有多核心處理器</p>
<p>因此程式很自然的是適用於單核心</p>
<p>現在掛到多核心電腦上跑</p>
<p>因此也只用到多核心處理器其中的一部份而已</p>
<p>剛剛說過 多核心處理器如果單看其中的一個核心的話</p>
<p>那單個核心是不會比單核心處理器強的</p>
<p>因此目前絕大多數的軟體沒辦法讓多核心處理器發揮極致的效能！</p>
<p>==</p>
<p>「軟體都推新版本出來了，新版本有支持多核心吧！」</p>
<p>打破新版本的軟體支持新硬體的迷思吧</p>
<p>誰說新版本的軟體一定支持新硬體？</p>
<p>我拿遊戲軟體做說明好了</p>
<p>大家都知道 遊戲軟體有自己所謂的遊戲引擎</p>
<p>用來執行這整個遊戲的</p>
<p>通常遊戲在推出新一代的時候</p>
<p>並不會對遊戲引擎做大幅度的修改</p>
<p>為什麼？因為遊戲引擎很難寫呀！</p>
<p>要撰寫新的遊戲引擎 會遠比修改遊戲資料還要麻煩</p>
<p>修改引擎那種工程是非常浩大的</p>
<p>沒有必要的話通常不會這麼做</p>
<p>所以啦 話說回來</p>
<p>核心沒修改 怎麼適應新硬體？</p>
<p>這樣不能發揮多核心的極致效能的！</p>
<p>==</p>
<p>扯了好遠好遠XD</p>
<p>該說回來了～ 我想換處理器～～XD<br>
<img src="@source/wordpress/amd-athlon64-le-1640-multi-core-cpu/images/amdathlon643500p.jpg" alt=""></p>
<p>這張圖是我現在電腦的CPU-Z資料</p>
<p>跟剛剛上面的LE1620比較起來的確差頗多</p>
<p>在L2 Cache、Multiplier、Revision、Stepping上有顯著的差異</p>
<p>重點是LE系列耗電量低</p>
<p>從Core Voltage看得出其差異</p>
<p>而且價錢頗便宜！不到兩千即可入手！</p>
<p><a href="http://www.pcdvd.com.tw/showthread.php?t=770445&amp;page=1&amp;pp=10" target="_blank" rel="noopener noreferrer">PCDVD數位科技討論區</a> 有對LE1640做評論</p>
<p>==</p>
<p>想換LE 1640</p>
<p>不過好像貨不多吼XD</p>
</div></template>


